# 算数(数学)运算符
print("1 + 1 = ", 1 + 1)  # 加
print("2 - 1 = ", 2 - 1)  # 减
print("3 * 3 = ", 3 * 3)  # 乘
print("4 / 2 = ", 4 / 2)  # 除  float形式，变更： print("4 / 2 = ", int(4 / 2))
print("11 // 2 = ", 11 // 2)  # 取整数
print("9 % 2 = ", 9 % 2)  # 取余
print("2 ** 3 = ", 2 ** 3)  # 指数

# 赋值运算符
# =  一个等号是赋值，右赋左

# 复合赋值运算符
"""
+=      加法复制运算符      c += a5 等效于 c = c + a5
-=      减法赋值运算符      c -= a5 等效于 c = c - a5
*=      乘法赋值运算符      c *= a5 等效于 c = c * a5
/=      除法赋值运算符      c /= a5 等效于 c = c / a5
%=      取模赋值运算符      c %= a5 等效于 c = C % a5
**=     幂赋值运算符       c **= a5 等效于 c = c ** a5
//=     取整除赋值运算符    c //= a5 等效于 c = c // a5
"""
